var testimonials_data = [
{"testimonial":"Jeremy understood my problem very quickly. He has always listened and has been available to solve the problem as quickly as possible. I hope I could still have someone like him at my next problem with the software.","jobtitle":"Customer survey comment"},
{"testimonial":"Excellent support from Jeremy as always.","jobtitle":"Customer survey comment"},
{"testimonial":"Jeremy has provided the highest quality support I've ever received. He goes the extra mile and is definitely an asset to be retained.","jobtitle":"Customer survey comment"},
{"testimonial":"Jeremy took the time to understand the issue and spotted the problem which was preventing us from completing a successful migration. Seemed to understand the product and the fundamentals of mail flow very well.","jobtitle":"Customer survey comment"},
{"testimonial":"Friendly and helpful. Kept giving feedback, calling and email which was very useful.","jobtitle":"Customer survey comment"},
{"testimonial":"Fantastic help provided by Jeremy. Knowledge was very good. I am new to the field of SMTP and networking so it was nice to have it explained in plain English.","jobtitle":"Customer survey comment"},
{"testimonial":"The support was excellent. Fast. Accurate. Informative.","jobtitle":"Customer survey comment"},
{"testimonial":"It took about a week before the actual resolution could start, as I was kept being called outside of office hours. I then asked to get resolution by email, and from this, resolution was quick and effecient.","jobtitle":"Customer survey comment"},
{"testimonial":"Overall I am very satisfied with the service. The case went on for several days, but the support engineer kept focus on the case and kept working on it. I did not have to call back or send reminders. I received updates about the progress and status all the time. Thanks for good help!","jobtitle":"Customer survey comment"},
{"testimonial":"Jeremy took the time to answer my questions and provided additional reading material. Very pleased with his response and fast turn around.","jobtitle":"Customer survey comment"},
{"testimonial":"Jeremy was extremely helpfully and went beyond what I had asked him even suggesting things that I could do in the future. It was refreshing to deal with your support it makes a huge change from all the rest, from that point alone I would recommend Barracuda.","jobtitle":"Customer survey comment"},
{"testimonial":"Your Technical Support Engineer Jeremy who I spoke to this morning has been outstanding in investigating the issue and although no permanent resolution is forthcoming at the moment I believe that he had done everything possible to resolve the issue. I come away from what was a potentially stressful situation in a positive frame of mind. The initial response I had felt like a bit of a fob off (indicating that I needed to upgrade my system) without first enquiring about the details of the issue. However my call this morning with Jeremy has made this a positive customer experience.","jobtitle":"Customer survey comment"},
{"testimonial":"Jeremy was very professional and courteous. Vast product and technical knowledge and a pleasure to deal with. The hard work is much appreciated.","jobtitle":"Customer survey comment"},
{"testimonial":"Very friendly & willing to take a step further to help us with this problem. Really helpful.","jobtitle":"Customer survey comment"},
{"testimonial":"It's always great to speak to Jeremy. He's a knowledgeable professional who you can rely on to give the right advice, and take the time to explain the parts that are unclear. Keept it up, thanks a lot!","jobtitle":"Customer survey comment"},
{"testimonial":"Jeremy was very professional and knowledgeable. I feel better about Barracuda as a result.","jobtitle":"Customer survey comment"},
{"testimonial":"I was working on below JIRA. I found that these are very well written JIRAs. Appreciate your efforts. What I liked about these 3 JIRAs is – exact steps provided, supported data and case backup provided, there are sufficient samples of data, there are 3-4 examples too, there is list of troubleshooting tries, there is analysis done, all 3 are related but you nicely separated them logically. It is enjoyable to work on such JIRAs.","jobtitle":"Senior Principal Software Engineer"},
{"testimonial":"I was impressed at the amount of work put in by the technical support engineer. He had deep knowledge of the product and related components and he put in additional work and investigation offline so that he had a workaround available during a follow-up WebEx. The support exceeded my expectations in this instance as I didn't think a solution or workaround would be possible.","jobtitle":"Customer survey comment"},
{"testimonial":"(In response to a newly submitted escalation report) Amazing write up and analysis as always. You have really raised the bar.","jobtitle":"Senior Manager, SQA Engineering"},
{"testimonial":"As a colleague and extended team member, I really appreciate all the hard work Jeremy has put in for many years now. Every time he has gone well above and beyond daily routine and responsibilities. ET-3895612 is one of the prime analysis where his work was so thorough that it has given every bit of information required to see the problem from all angles. There are countless other issues, where his analysis and insight of code has always been appreciated within CFT and engineering teams. Keep up the great work.","jobtitle":"Principal SQA Engineer"},
<<<<<<< HEAD
{"testimonial":"I just can’t thank you enough. Jeremy is the master and guru in our team, he is the expert and my last resort if I'm stuck with any issues, and once I’ve gone to him I know he has the solution to my issues. I have personally dealt / resolved a number of issues reading his KB’s and it’s just fantastic contribution. He is the man who knows all the coding and talks for us with engineering which helps so much to take pressure from us.","jobtitle":"Advanced Technical Support Engineer"},
=======
{"testimonial":"I just can’t thank you enough. Jeremy is the master and guru in our team, he is the expert and my last resort if I'm stuck with any issues, and once I’ve gone to him I know he has the solution of my issues. I have personally dealt / resolved number of issues reading his KB’s and it’s just fantastic contribution. He is the man who knows all the coding and talks for us with engineering which helps so much to take pressure from us.","jobtitle":"Advanced Technical Support Engineer"},
>>>>>>> 49a25984c7719db7ac9c57b61fb2b66eedf13b22
{"testimonial":"Jeremy's analysis is always on-point and he goes above and beyond when researching an issue before escalating to CFT (Engineering). He is also clear and concise in his description of an issue, yet he provides a wealth of information. Both of these make CFT's job easier because we can use his prior work as a jumping off point. For ET-3896404, he basically solved the escalation himself, with me doing a sanity check and code review.","jobtitle":"Senior Principal Software Engineer"},
{"testimonial":"I had opportunity to work on few Etracks analyzed by Jeremy, it’s always a pleasure. His analysis is in-depth, and in most of the cases I got the opportunity to learn from him. I always found the reproduction steps are in detail and clear, and he goes beyond and creates artifacts which requires deep understanding of business domain and product architecture. I found him well versed with latest scripting and programming paradigms, which is evident of his high quality of artifacts. He is always available for any question and knowledge transfer. His customer relation is commendable. For example the current Etrack I am looking, he made available high quality artifacts which not only show his understanding about the product but also other peripheral technologies. One of the greatest strength I found is his suggested solution, shows his excellent software development skill apart from analysis. It’s always pleasure to work with him, his willingness for knowledge transfer and his enthusiasm to explore new aspects of product and technology.","jobtitle":"Senior Software Engineer"},
{"testimonial":"Jeremy is, without a shadow of a doubt, the EMEA team's expert and authority on the eDiscovery Clearwell platform. His case handling, troubleshooting and analytical skills are exceptional. There is not a single time that I have asked for his assistance that he has ever turned me down or been unhelpful. In terms of work ethic, I cannot ask for any better from a team mate. He is diligent and hardworking. At times, I do worry that he will leave the team to join engineering or CFT. When he creates eTracks, the data and analysis he includes goes far beyond what is expected of someone in a similar role at Veritas. In many instances I have seen that he has done CFT's work for them, highlighting precisely where in the code a change might need to be made, and what the change should be. It is no exaggeration to say that Jeremy's focus on quality rather than quantity is refreshing.","jobtitle":"Principal Tech Support Engineer"},
{"testimonial":"Jeremy, You're one of InfoDev's favorite contributors! Whenever you submit an issue, the problem has always been carefully researched, tested and invariably lays out a thorough product and documentation dissection of the topic. Many times your issues have prompted incisive discussions not only with the doc team but with development and product QA as well. Your stellar research, sharing of investigations, involvement of wider teams to thoroughly address problems are what distinguishes your work and prompts the award. I should add that the tone and tenor of your notes is always appreciated. Don't know what the Reading eDiscovery team looks like these days but your responsiveness and dedication to keeping the documentation in sync as well as your primary customer support focus is greatly appreciated.","jobtitle":"Senior Principal Information Developer (Documentation)"},
{"testimonial":"Jeremy, just wanted to thank you for the great work you did in assisting me on the escalation. The work you did in not just identifying the cause of the issue but also testing a possible solution which involved making some code changes which you've now raised with engineering for official support. This has also saved engineering's time in diagnosing the issue and creating a solution themselves. Thanks as always.","jobtitle":"Principal Technical Support Engineer"},
{"testimonial":"Jeremy, I would like to thank you for your amazing work and support. You are trying to solve unsolvable issues and you are very succesful doing it! I wish you further success and looking forward to working with you again.","jobtitle":"eDiscovery Lead Principal, Professional Services"},
{"testimonial":"Jeremy is always very thorough in all his support cases. For this case in particular, this issue could have put a stop to the Bank's impending Professional Services deal for their upgrade. Although the version of eDP was out of engineering support, Jeremy still researched the problem by reproducing in his own lab, creating a valid fix which is both inline with future supported versions as well as the current one the Bank is on and then had this approved by Engineering. This led to a swift resolution to the issue and the consultancy deal back on the table. This ALWAYS happens with Jeremy. He is truly an amazing engineer with excellent knowledge and proactive attitude.","jobtitle":"Global Business Critical Account Manager"},
{"testimonial":"I cannot thank XXXXXXXX and Jeremy enough for their amazing dedication and work on the 100s of XXXXXXXX's Clearwell cases. I would chose all 4 reasons for this award: Action - they quickly pick up and tackle the urgent cases, often with very tight deadlines and critical business impact for the lawyers/customers of the bank, often working over their standard hours to ensure the issues are properly resolved or at a stable state. Customer-driven - understanding the bank, their environments and their requirements and how they use the tool. The guys are dedicated to ensure the bank receive the best support level. Innovation - plenty of hotfixes have been given to the bank, behind these hotfixes was hours of hard work to identify the complex issues, test in house and submit thorough reviews to Engineering so that Engineering could focus on the actual code changes rather than work behind it. Trust - not just for the bank but also for the BCAM (Buisiness Critical Account Manager), without these guys, I would not be able to support the bank and we would never have gotten to this stage where the bank are happy with the relatively stable product and trust the commitment we have to them. KEEP UP THE AWESOME WORK!!!","jobtitle":"Global Business Critical Account Manager"},
{"testimonial":"I needed quick feedback due to a customer holding back on a renewal. Jeremy responded very quickly and promptly with information that helped put the end user at ease. Thanks Jeremy.","jobtitle":"Renewal Inside Sales Rep"},
{"testimonial":"(Award: Results Beyond Expectations) Jeremy, Congratulations on achieving the most improved TSE for your product in EMEA. It is my pleasure on behalf of the EMEA management team to acknowledge the hard work you have put in over the last 6 months and raise this award in recognition of your efforts. Keep up the hard work and focus.","jobtitle":"Senior Director Global Customer Services"},
{"testimonial":"(Award: Assistance and Going the extra mile) Thank you for your excellent technical skills and for staying behind to assist and formulate a resolution which will now be able to help my customer if they have the same issue in the future. This will certainly help them in the long term.","jobtitle":"Senior Technical Account Manager"},
{"testimonial":"Thanks for looking after my cases in my absense, especially the ones for XXXXXXXX. Both cases required code level knowledge to understand what the product was doing at the point of failure as the error logging did not provide enough detail to move the cases forward and identify the issues. With your help we've been able to identify where the issue is. Many thanks.","jobtitle":"Principal Technical Support Engineer"},
{"testimonial":"Just a small thank you for all your help with the latest XXXXXXXX's issues. Your dedication, focus and drive to investigate the current issues is truly outstanding and should not go unnoticed by management. Thanks again.","jobtitle":"Principal Business Critical Engineer"},
{"testimonial":"We have worked closely with Jeremy over the last two years. Jeremy has been a first class support to the team in terms of providing detailed information, carrying out thorough investigations and first class response times to any of our incidents. Jeremy goes the extra mile to resolve our incidents, often writing his own scripts and really getting into the details of what is causing the incidents. Jeremy exceeds expectations; going beyond what would be considered as standard support in this industry. There have been many obstacles to overcome and without Jeremy's attention to detail, input and hard work we would not be able to offer as a good a service to the Bank. We really value Jeremy's work and his dedication contributes to our success.","jobtitle":"Feedback from customer to Veritas Business Critical Account Manager"},
{"testimonial":"From a Sales/Consultancy perspective, Jeremy is always the point of contact should they need clarification on certain aspects that the customer is complaining about in a separate meeting they hold. Why does our tool not work as they would like, what areas should be working differently, what is the actual issue (us or them!), these are all the types of questions that Jeremy would answer swiftly and with extensive detail, rarely leaving questionable points. Whenever consultancy were due onsite for upgrades or other, their first point of call was Jeremy. Many times, the Sales/Consultancy team would tell me just how super Jeremy was and what an asset he was. They have sold a large multi-million pound deal to the bank, without Jeremy's efforts in stabilizing the current environment and his commitment in getting the issues resolved, I'm positive that the deal would not have happened.","jobtitle":"Business Critical Account Manager"},
{"testimonial":"Thanks for stepping in yet again, unbidden, to assist with a warm passdown I'd taken. Your advice actually saved me a full day's troubleshooting for the client. You continue to floor me with the quality of your assistance and dedication to customers.","jobtitle":"Senior Technical Support Engineer"},
{"testimonial":"Congratulations on winning the Knowledge Ninja Award for the Week of July 6th. Thanks for creating quality articles and for your participation toward our knowledge base.","jobtitle":"Senior Manager Technical Support"},
{"testimonial":"Thank you for the support and guidance to allow me to easily get the information from Engineering. Finding the Java item and then being able to offer a partial solution made a real difference rather than just saying No to the customer.","jobtitle":"Technical Support Engineer"},
{"testimonial":"Jeremy, You have never ceased to amaze me with your innovative ways of solving any customer problem brought to your attention and many a time avoiding escalations to Backline/Engineering. Thank you for your efforts.","jobtitle":"Senior Principal Technical Support Engineer"},
{"testimonial":"Jeremy not only pointed out what could be the issue, he also took the time to verify and test the theory.","jobtitle":"Senior Principal Technical Support Engineer"},
{"testimonial":"Thank you for your assistance with Case 06463344 when looking into the logs to establish what the issue was. Help was greatly appreciated and offered without hesitation.","jobtitle":"Senior Technical Support Engineer"},
{"testimonial":"A big thank you for your help with the XXXXXXXX case and sticking around to help with the testing.","jobtitle":"Senior Technical Support Engineer"},
{"testimonial":"Thank you for your script on 06376032 which saved sending someone to site, to be able to do this remotely is a great advantage.","jobtitle":"Technical Support Engineer"},
{"testimonial":"Hi Jeremy, Thank you so much on your efforts with the a4m utility. Without your input I would never have manually converted the Mbox. We now have a technote our there with your class and batch files; all TSEs can now run the utility. Thanks.","jobtitle":"Senior Principal Technical Support Engineer"},
{"testimonial":"Jeremy, thank you for taking on case 05224956, and putting up with the constant arguments about Korean characters and wanting things to work the nice way, I know you'll continue with the best interest of the customer.","jobtitle":"Senior Technical Support Engineer"},
{"testimonial":"I just wanted to say well done for staying till 9:30pm to help Backline and Engineering with the customer. Also to show my appreciation for your painstaking analysis of their appliances when the system went down last week.","jobtitle":"Advanced Technical Support Engineer"},
{"testimonial":"Thanks a million for helping me out with a case involving a bug that was supposed to have been resolved in Fix 2. The post-Fix fix worked and the customer is delighted. Also want to say that I'm really glad you're on the team and for all your enthusiasm and dedication.","jobtitle":"Advanced Technical Support Engineer"},
{"testimonial":"Jeremy, your focus on the significant problems at XXXXXXXXXX has made a huge difference in finding solutions to the current situation there. The IIG technical team and the wider account team really appreciate the effort you have put in to find resolutions, support XXXXXXXX, and get the customer back on our side.","jobtitle":"eDiscovery Consultant EMEA"}
]
